# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 45  # number of classes
scales:
  # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1, 1, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DWConv, [64, 3, 2]]  # 0
  - [-1, 3, C2f, [64, True]]     #1-P1
  - [-1, 1, DWConv, [128, 3, 2]]
  - [-1, 1, C2f, [128, True]]    # 3-P2
  - [-1, 1, DWConv, [256, 3, 2]]
  - [-1, 1, C2f, [256, True]]    # 5-P3
  - [-1, 1, DWConv, [512, 3, 2]]
  - [-1, 1, C2f, [512, True]]   #7-P4
  - [ -1, 1, DWConv, [ 512, 3, 2 ] ]
  - [ -1, 1, C2f, [ 512, True ] ]#9
  - [-1, 1, SPPF, [512]] #10-P5

# YOLOv8.0n head
head:
  - [-1,1,nn.Upsample,[None,2,'bilinear']]#11
  - [ [-1,7], 1, Concat, [1]]#12
  - [-1,1,nn.Upsample,[None,2,'bilinear']]#13
  - [ [ -1,5 ], 1, Concat, [ 1 ] ]#14
  - [-1, 1, DRFAM, [128]]#15
  - [ -1,1,nn.Upsample,[ None,2,'bilinear' ] ]#16
  - [[-1,3], 1, Concat, [1]]  #17
  - [-1, 1, DWConv, [128, 1, 1]]#18
  - [-1, 1, DWConv, [128, 3, 1]]#19
  - [10, 1, DWConv, [128, 1, 1]]#20
  - [-1, 1, DWConv, [128, 3, 1]]#21
  - [ 12, 1, DWConv, [ 128, 1, 1 ] ]#22
  - [ -1, 1, DWConv, [ 128, 3, 1 ] ]#23
  - [[19,21,23], 1, Detect, [nc]] # Detect